Reports/дог_ОстаткиЗадолженностиБУПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>дог_ОстаткиЗадолженностиБУПоДоговору</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/дог_ОстаткиЗадолженностиБУПоДоговору/Ext/ObjectModule.bsl
Перем ДанныеРасшифровки Экспорт;
Перем СохраненнаяНастройка Экспорт;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого Реквизит Из Метаданные().Реквизиты Цикл
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Реквизит.Имя,?(Реквизит.Имя="ДатаОтчета",КонецДня(ДатаОтчета),ЭтотОбъект[Реквизит.Имя]));
	КонецЦикла;
	Отчеты.дог_ОстаткиЗадолженностиБУПоДоговору.ДоработатьКомпоновщикПередВыводом(КомпоновщикНастроек,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ДоговорКонтрагента);
	СтандартнаяОбработка = Ложь;
	////Вывод
	КомпоновщикМакетаСКД = Новый КомпоновщикМакетаКомпоновкиДанных();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	МакетСКД = КомпоновщикМакетаСКД.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
	
	ПроцессорСКД = Новый ПроцессорКомпоновкиДанных();
	ПроцессорСКД.Инициализировать(МакетСКД,,ДанныеРасшифровки,Истина);
	
	ПроцессорВыводаСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ДокументРезультат.Очистить();
	ПроцессорВыводаСКД.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаСКД.Вывести(ПроцессорСКД);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
  
Процедура Скомпоновать(ДокументРезультат) Экспорт
	СкомпоноватьРезультат(ДокументРезультат,ДанныеРасшифровки);	
КонецПроцедуры
